badgeteam/mch2022-firmware-esp32/main/main.c
        if (render) {
            graphics_task(pax_buffer, ili9341, menu, NULL);
            render = false;
        }

        if (menuArgs != NULL) {
            *appfs_fd = menuArgs->fd;
            *menu_action = menuArgs->action;
            break;
        }
    }

    for (size_t index = 0; index < menu_get_length(menu); index++) {
        free(menu_get_callback_args(menu, index));
    }

    menu_free(menu);
}

void menu_wifi_settings(xQueueHandle buttonQueue, pax_buf_t* pax_buffer, ILI9341* ili9341, menu_action_t* menu_action) {
    menu_t* menu = menu_alloc("WiFi settings");
    *menu_action = ACTION_NONE;

    menu_args_t* wifi_scan_args = malloc(sizeof(menu_args_t));
    wifi_scan_args->action = ACTION_WIFI_SCAN;
    menu_insert_item(menu, "Add by scan...", NULL, wifi_scan_args, -1);

    menu_args_t* wifi_manual_args = malloc(sizeof(menu_args_t));
    wifi_manual_args->action = ACTION_WIFI_MANUAL;
    menu_insert_item(menu, "Add manually...", NULL, wifi_manual_args, -1);

    menu_args_t* wifi_list_args = malloc(sizeof(menu_args_t));
    wifi_list_args->action = ACTION_WIFI_LIST;
    menu_insert_item(menu, "List known networks", NULL, wifi_list_args, -1);

    menu_args_t* back_args = malloc(sizeof(menu_args_t));
    back_args->action = ACTION_BACK;
    menu_insert_item(menu, "< Back", NULL, back_args, -1);

    bool render = true;
    menu_args_t* menuArgs = NULL;

    while (1) {
        rp2040_input_message_t buttonMessage = {0};
        if (xQueueReceive(buttonQueue, &buttonMessage, 16 / portTICK_PERIOD_MS) == pdTRUE) {
            uint8_t pin = buttonMessage.input;
            bool value = buttonMessage.state;
            switch(pin) {
                case RP2040_INPUT_JOYSTICK_DOWN:
                    if (value) {
                        menu_navigate_next(menu);
                        render = true;
                    }
                    break;
                case RP2040_INPUT_JOYSTICK_UP:
                    if (value) {
                        menu_navigate_previous(menu);
                        render = true;
                    }
                    break;
                case RP2040_INPUT_BUTTON_ACCEPT:
                    if (value) {
                        menuArgs = menu_get_callback_args(menu, menu_get_position(menu));
                    }
                    break;
                default:
                    break;
            }
        }

        if (render) {
            graphics_task(pax_buffer, ili9341, menu, NULL);
            render = false;
        }

        if (menuArgs != NULL) {
            *menu_action = menuArgs->action;
            break;
        }
    }

    for (size_t index = 0; index < menu_get_length(menu); index++) {
        free(menu_get_callback_args(menu, index));
    }

    menu_free(menu);
}

void display_boot_screen(pax_buf_t* pax_buffer, ILI9341* ili9341) {
    pax_noclip(pax_buffer);
    pax_background(pax_buffer, 0x325aa8);
    pax_draw_text(pax_buffer, 0xFFFFFFFF, NULL, 18, 0, 20*0, "Starting launcher...");
    ili9341_write(ili9341, pax_buffer->buf);
}

void display_fatal_error(pax_buf_t* pax_buffer, ILI9341* ili9341, const char* line0, const char* line1, const char* line2, const char* line3) {
    pax_noclip(pax_buffer);
    pax_background(pax_buffer, 0xa85a32);
    if (line0 != NULL) pax_draw_text(pax_buffer, 0xFFFFFFFF, NULL, 18, 0, 20*0, line0);
    if (line1 != NULL) pax_draw_text(pax_buffer, 0xFFFFFFFF, NULL, 12, 0, 20*1, line1);
    if (line2 != NULL) pax_draw_text(pax_buffer, 0xFFFFFFFF, NULL, 12, 0, 20*2, line2);
    if (line3 != NULL) pax_draw_text(pax_buffer, 0xFFFFFFFF, NULL, 12, 0, 20*3, line3);
    ili9341_write(ili9341, pax_buffer->buf);
}

// void wifi_connect_to_stored() {
//     wifi_connect_ent("MCH2022-legacy", "thefunny", "q", "nope, you are not", 3);
// }

void wifi_connect_to_stored() {
    // Open NVS.
    nvs_handle_t handle;
    nvs_open("system", NVS_READWRITE, &handle);
    uint8_t use_ent;
    char *ssid = NULL;
    char *ident = NULL;
    char *anon_ident = NULL;
    char *password = NULL;
    size_t len;
    
    // Read NVS.
    esp_err_t res;
    // Read SSID.
    res = nvs_get_str(handle, "wifi.ssid", NULL, &len);
    if (res) goto errcheck;
    ssid = malloc(len);
    res = nvs_get_str(handle, "wifi.ssid", ssid, &len);
    if (res) goto errcheck;
    // Check whether connection is enterprise.
    res = nvs_get_u8(handle, "wifi.use_ent", &use_ent);
    if (res) goto errcheck;
    if (use_ent) {
        // Read enterprise-specific parameters.
        // Read identity.
        res = nvs_get_str(handle, "wifi.ident", NULL, &len);
        if (res) goto errcheck;
        ident = malloc(len);
        res = nvs_get_str(handle, "wifi.ident", ident, &len);
        // Read anonymous identity.
        res = nvs_get_str(handle, "wifi.anon_ident", NULL, &len);
        if (res) goto errcheck;
        anon_ident = malloc(len);
        res = nvs_get_str(handle, "wifi.anon_ident", anon_ident, &len);
        if (res) goto errcheck;
    }
    // Read password.
    res = nvs_get_str(handle, "wifi.password", NULL, &len);
    if (res) goto errcheck;
    password = malloc(len);
    res = nvs_get_str(handle, "wifi.password", password, &len);
    if (res) goto errcheck;
    
    // Close NVS.
    nvs_close(handle);
    
    // Open the appropriate connection.
    if (use_ent) {
        wifi_connect_ent(ssid, ident, anon_ident, password, 3);
    } else {
        wifi_connect(ssid, password, WIFI_AUTH_WPA2_PSK, 3);
    }
    
    errcheck:
    if (res == ESP_ERR_NVS_NOT_FOUND || res == ESP_ERR_NVS_NOT_INITIALIZED) {
        // When NVS is not initialised.
        ESP_LOGI(TAG, "WiFi settings not stored in NVS.");
    } else if (res) {
        // Other errors.
        ESP_LOGE(TAG, "Error connecting to WiFi: %s", esp_err_to_name(res));
    }
    
    // Free memory.
    if (ssid) free(ssid);
    if (ident) free(ident);
    if (anon_ident) free(anon_ident);
    if (password) free(password);
}

void list_files_in_folder(const char* path) {
    DIR* dir = opendir(path);
    if (dir == NULL) {
        ESP_LOGE(TAG, "Failed to open directory %s", path);
        return;
    }

    struct dirent *ent;
    char type;
    char size[12];
    char tpath[255];
    char tbuffer[80];
    struct stat sb;
    struct tm *tm_info;
    char *lpath = NULL;
    int statok;

    uint64_t total = 0;
    int nfiles = 0;
    printf("T  Size      Date/Time         Name\n");
    printf("-----------------------------------\n");
    while ((ent = readdir(dir)) != NULL) {
        sprintf(tpath, path);
        if (path[strlen(path)-1] != '/') {
            strcat(tpath,"/");
        }
        strcat(tpath,ent->d_name);
        tbuffer[0] = '\0';

